lang:Deutsch

//please store all files as Unicode!

Strings:NewCode=Neuer Code
Strings:Question=Eingebaaufforderung
Strings:NewName=Bitte gebe den gewünschen Code-Namen ein

Strings:LowUnmovable=Das letzte Listen-Element kann nicht nach unten verschoben werden
Strings:HighUnmovable=Das höchste Listen-Element kann nicht nach oben verschoben werden

Strings:Attention=Vorsicht
Strings:CodeChange=Die Codes wurden verändert, möchtest du die Änderungen speichern?\nDer Speichervorgang erfolgt programm-intern, die TXT-Datei wird nicht verändert.\nAndernfalls werden Änderungen verworfen!

Strings:Duplicated=Kopie

Strings:Stored=Gesichert!
Strings:InvalidLine=Ungültige Zeile: %s
Strings:NameMissing=Bitte gebe einen Code-Namen ein!
Strings:NoSelection=Es wurde kein Code ausgewählt
Strings:InvalidID=Ungültige Spiel-ID - nur der Name wird gespeichert!

Strings:ChangeBeforeExport=Es wurden Codes modifiziert. Möchtest du die Änderungen übernehmen, andernfalls werden sie nicht exportiert!
Strings:CodeError1=Fehler bei Code:
Strings:CodeError2=Womöglich müssen vorerst Platzhalter-Zeichen (XX) korrekt ersetzt werden!
Strings:NoGameId=Keine Spiel-ID angegeben. Möchtest du dennoch fortfahren?
Strings:Error=Fehler
Strings:StoredTo=GCT unter %s abgespeichert!
Strings:SaveError=Speicher-Fehler

Strings:Credits=Gecko Cheat Cheat Code-Manager\n\nCodelisten-Konzept von James0x57\nCode Manager von Link\nGecko OS von brkirch und Nuke

Strings:RemoveQuest=Bist du dir sicher - dieser Schritt kann nicht rückgängig gemacht werden!

MainForm:_:_:Caption=Gecko Cheat Code-Manager

MainForm:FileMenu:WMENUITEM:Caption=Datei
MainForm:NewL:WMENUITEM:Caption=Neue Liste
MainForm:OpenTXTfile:WMENUITEM:Caption=TXT-Datei öffnen
MainForm:StoreTXT:WMENUITEM:Caption=TXT-Datei speichern
MainForm:ExporttoGCT:WMENUITEM:Caption=Als GCT-Datei exportieren
MainForm:Closeprog:WMENUITEM:Caption=Programm schließen

MainForm:RemoveSel:WMENUITEM:Caption=Auswahl löschen
MainForm:AllDown:WMENUITEM:Caption=Alle gewählten eins nach unten verschieben
MainForm:AllUp:WMENUITEM:Caption=Alle gewählten eins nach oben verschieben
MainForm:DuplicateSelected:WMENUITEM:Caption=Ausgewählte Codes duplizieren
MainForm:BottomSend:WMENUITEM:Caption=Gewählte Codes ans Listenende verschieben

MainForm:OptionsMenu:WMENUITEM:Caption=Optionen
MainForm:LangMenu:WMENUITEM:Caption=Sprache

MainForm:AboutMenu:WMENUITEM:Caption=?
MainForm:AboutSelect:WMENUITEM:Caption=Über

MainForm:GidBox:WGROUPBOX:Caption=Spiel-ID
MainForm:GNameBox:WGROUPBOX:Caption=Name
MainForm:StBtn:WBUTTON:Caption=ID/Name speichern

MainForm:AddCode:WBUTTON:Caption=Code/Kategorie/Kommentar hinzufügen

MainForm:CodeNameBox:WGROUPBOX:Caption=Code-/Kommentar-/Kategorie-Name
MainForm:CodeContBox:WGROUPBOX:Caption=Code-Werte (leer lassen für Kategorien/Kommentare)
MainForm:CommentGroup:WGROUPBOX:Caption=Code-Kommentar (leer lassen für Kategorien)
MainForm:CmtType:WCOMBOBOX:Item0=Eigener Kommentar
MainForm:CmtType:WCOMBOBOX:Item1=Kommentar lesen von:
MainForm:StoreMods:WBUTTON:Caption=Änderungen speichern

MainForm:GCTExport:WBUTTON:Caption=Als GCT exportieren


Strings:NoValidDrive=Es ist kein gültiges Laufwerk ausgewählt!
Strings:StoringTo=Ziel-Dateiname: %s

SaveForm:_:_:Caption=Export-Manager

SaveForm:HardGroup:WGROUPBOX:Caption=Als Datei speichern
SaveForm:StoreHard:WBUTTON:Caption=Als Datei speichern

SaveForm:SDGroup:WGROUPBPX:Caption=Auf SD-Karte speichern
SaveForm:DriveLabel:WLABEL:Caption=Laufwers-Buchstabe:
SaveForm:StoreTo:WPANEL:Caption=Es ist kein gültiges Laufwerk ausgewählt!
SaveForm:StoreSecure:WBUTTON:Caption=Speichern
SaveForm:CncButton:WBUTTON:Caption=Abbrechen

//-------------------- Additions since the last version

SaveForm:SDGroup:WGROUPBOX:Caption=Auf SD-Karte speichern

Strings:DialogOK=OK
Strings:DialogCancel=Abbrechen

Strings:TooManyCodes=Es sind mehr als 256 Code-Zeilen aktiv.\nMöchtest du dennoch fortfahren?


